Repository: diegodlh/jamulus-es
Catalog: Recursos_OmegaT/jamulus-omegat.tmx
Source language: en_gb
Languages: es_es

source: First of all close all applications (especially those which could access your soundcard) to minimize conflicts. If you’re using the ASIO4All driver, make sure the correct inputs/outputs in its control panel are switched on: open Jamulus's settings, go to "ASIO Settings", enable advanced view (click the tool icon on the bottom right) and open your soundcard inputs by clicking the plus icon next to the soundcard name. Next enable/disable the correct inputs/outputs. You may need to experiment a bit to find the right ones since every computer is a bit different. Do this while you're connected to a server to hear your instrument or voice. If nothing works, try to restart Jamulus or your PC. More info can be found in the ASIO4All manual which can most likely be found on your desktop.
es_es: Primero cierra todas las aplicaciones (sobre todo aquellos que podrían acceder a tu tarjeta de sonido) para minimizar conflictos. Si estás utilizando el driver ASIO4ALL, asegúrate de que las entradas/salidas en su panel de control están activadas: abre la ventana de configuración de Jamulus, ve a "Configuración ASIO", activa advanced view (haz clic en el icono de la herramienta abajo a la derecha) y abre las entradas de la tarjeta de audio haciendo clic en el icono de plus al lado del nombre de la tarjeta. Ahora activa/desactiva las entradas/salidas correctas. Puede que tengas que experimentar un poco para encontrar las correctas porque cada ordenador es diferente. Haz esto estando conectado a un servidor para escuchar tu voz o instrumento. Si nada de esto funciona, prueba a reiniciar Jamulus o tu PC. Se puede consultar más información en el manual de ASIO4ALL que probablemente se encuentre en tu escritorio.

source: ami-09d918ccde05958cb
es_es: AMI

source: Home \> Running a Server \> Jamulus in the Cloud
es_es: Inicio \> Ejecutar un Servidor \> Jamulus en la Nube

source: Jamulus user skrul has put up some public EC2 AMIs of Ubuntu 18.04 running Jamulus.
es_es: El usuario de Jamulus skrul ha proporcionado unas AMI públicas en EC2 de Ubuntu 18.04 ejecutando Jamulus.

source: Launch an instance from the AMI in the region you want (you can use use m3.small) and make sure you add the "All UDP / Anywhere" rule to the security group before launching.
es_es: Lanza una instancia desde la AMI en laregión que quieres (puedes utilizar m3.small) y asegúrate de añadir la regla "All UDP / Anywhere" al grupo de seguridad antes de lanzarla.

source: Note as of April 2020: These instances come with Jamulus v3.5.0. Before running your server, you are strongly advised to check the current release and upgrade to that.
es_es: Nota a fecha de abril 2020: Estas instancias vienen con v3.5.0. Antes de ejecutar tu servidor, se recomienda encarecidamente que compruebes la última versión y te actualices a esa.

source: AMIs Available
es_es: AMIs Disponibles

source: Region
es_es: Región

source: You will see a notice if you are connected to a Jamulus server while server recording is turned on. Recordings of each player are stored by the server separately as .WAV files and only the server operator has access to them.
es_es: Durante una conexión con un servidor Jamulus, si se activa la grabación verás una notificación. Las grabaciones de cada músico son guardadas por el servidor como archivos .WAV separados, y solamente tiene acceso a ellos el operador del servidor.

source: Text Chat
es_es: Texto del Chat

source: When you type a message in the Chat Window, other connected players can see that, but chats are not stored by the server and neither the server operator nor any third parties have access to them.
es_es: Cuando escribes un mensaje en la Ventana del Chat, otros músicos conectados lo pueden ver, pero los chats no son guardados por el servidor y ni el operador del servidor ni ningún tercero tiene acceso a ellos.

source: Home \> Privacy Stastement
es_es: Inicio \> Declaración de Privacidad

source: Use of Profile Information
es_es: Uso de Datos del Perfil

source: When you connect to a public or private Jamulus server, whatever you put in My Profile (in Settings) will be shown to others on that server while you are connected to it. The server does not otherwise store or record your Profile information and the server operator has no access to it unless they are also connected as a client.
es_es: Cuando te conectas a un servidor público o privado de Jamulus, lo que escribas en Mi Perfil (en Configuración) será mostrado a terceros conectados a ese servidor mientras dure tu conexión. El servidor no guarda ni registra los datos de tu Perfil y el operador del servidor no tiene acceso a ellos a menos que también se conecte como cliente.

source: When you connect to a public server, your profile is also available to third parties from the Central Server to which that server is registered. This is can be for informational purposes about the status of the public Jamulus network (for example, here), but may not be limited to that. Profile information is not otherwise logged or stored by the Jamulus server you are connected to, or by the Jamulus Central Server, but may be stored or processed by third parties.
es_es: Cuando te conectas a un servidor público, tu perfil también es accesible por parte de terceros desde el Servidor Central en el cual está registrado ese servidor. Esto puede ser para fines informativos sobre el estado de la red pública de Jamulus (por ejemplo, aquí), pero puede no limitarse a esto. Los datos de perfil no son registrados ni guardados por parte del servidor de Jamulus al cual estás conectado, o por parte del Servidor Central de Jamulus, pero pueden ser guardados o procesados por terceros.

source: Use of IP Addresses
es_es: Uso de Direcciones IP

source: When you connect to a public or private server, the server operator can see your IP address while you are connected. If the server operator has enabled logging (which is off by default) your IP address will also be logged and stored in the server's log file.
es_es: Cuando te conectas a un servidor público o privado, el operador del servidor puede ver tu dirección IP mientras dure tu conexión. Si el operador del servidor ha habilitado el registro (que está deshabilitado por defecto) tu dirección IP será registrado y guardado en el archivo de registro del servidor.

source: As a server operator, when you register a public server with a Central Server, your IP address is sent to Google (8.8.8.8) in order to identify your public IP address. The IP addresses of all public servers registered with the Central Server can also be seen by third parties for informational or other purposes (for example here). Your public IP address is otherwise not logged or stored by Jamulus, but may be stored or processed by third parties.
es_es: Como operador de un servidor, cuando tu registras un servidor público con un Servidor Central, tu dirección IP es enviada a Google (8.8.8.8) para identificar tu dirección IP pública. Las direcciones IP de todos los servidores públicos registrados con el Servidor Central también pueden ser vistas por terceros para fines informativos u otros fines (por ejemplo aquí). Tu dirección IP pública no es registrada ni guardada por parte de Jamulus, pero puede ser guardada o procesada por terceros.

source: Users concerned by the use of Google's network can re-compile the Jamulus source code to use an alternative.
es_es: Los usuarios preocupados por el uso de la red de Google pueden re-compilar el código fuente de Jamulus para utilizar una alternativa.

source: Audio Recordings
es_es: Grabaciones de Audio

source: Mbps : Mega-bits per seconds
es_es: Mbps : Mega-bits por segundo

source: Channels
es_es: Canales

source: Quality
es_es: Calidad

source: Bandwidth (for buffer : 2.67ms)
es_es: Ancho de banda (para buffer : 2,67ms)

source: Bandwidth (for buffer : 5.33ms)
es_es: Ancho de banda (para buffer : 5,33ms)

source: Bandwidth (for buffer : 10.67ms)
es_es: Ancho de banda (para buffer : 10,67ms)

source: Bandwidth (for buffer : 21.33ms)
es_es: Ancho de banda (para buffer : 21,33ms)

source: Home \> Using Jamulus \> Network requirements
es_es: Inicio \> Uso de Jamulus \> Requisitos de red

source: Medium
es_es: Media

source: Audio bandwidth
es_es: Ancho de banda de audio

source: The audio settings have an impact on the required network bandwidth. The below table summarizes the network requirements with respect to the configuration of:
es_es: La configuración de audio tiene un impacto en el ancho de banda de red requerido. La tabla siguiente resume los requisitos con respecto a la configuración de:

source: channels : stereo/mono
es_es: canales : estéreo/mono

source: Network bandwidth
es_es: Ancho de banda de red

source: There is one upstream (musician sending to the server) and one downstream (server sending back the mix to the musician)
es_es: Hay un flujo de datos de subida (músico enviando al servidor) y otro de bajada (el servidor enviando la mezcla de vuelta al músico)

source: Note also that mean ADSL2 transfer rate is 10 Mbits/second for downstream and 1 Mbit/second for upstream. The actual performance depends on distance to the provider, which may theoretically range from 24Mb/s at 0.3km to 1.5Mb/s at 5.2km for download rate.
es_es: Nótese que la tasa de transferencia media de ADSL2 es de 10 Mbits/segundo para bajada y 1 Mbit/segundo para subida. El rendimiento real depende de la diatancia al proveedor, que puede variar en teoría de 24Mb/s a 0,3km hasta 1,5Mb/s a 5,2km para la tasa de descarga.

source: quality : high/medium/low
es_es: calidad : alta/media/baja

source: audio buffer duration : 2.67ms, 5.33ms, 10.67ms, 21.33ms
es_es: duración buffer audio : 2,67ms, 5,33ms, 10,67ms, 21,33ms

source: With the following units
es_es: Con las siguientes unidades

source: ms : milliseconds
es_es: ms : milisegundos

source: Kbps : Kilo-bits per seconds (Reminder : 1Mbps = 1024Kbps, 1KByte = 8Kbits)
es_es: Kbps : Kilo-bits por segundo (Recordatorio : 1Mbps = 1024Kbps, 1KByte = 8Kbits)

source: Install and open Voicemeeter;
es_es: Instala y abre Voicemeeter;

source: Open configured Jack PortAudio shortcut, Jack Control and Jamulus software;
es_es: Abre el acceso directo de Jack PortAudio, Jack Control y Jamulus;

source: On Voicemeeter, go to HARDWARE OUT and on A1 dropdown list, select JackRouter. On Hardware Input 1 select your computer microphone. You can make your computer microphone have the lowest latency possible by going into Menu > System Settings/Options... and enabling WDM Input Exclusive Mode (if you experience crackling noises while speaking, disable this) and changing the Engine Mode to Swift;
es_es: En Voicemeeter, ve a HARDWARE OUT y en el menú desplegable A1, selecciona JackRouter. En Hardware Input 1 selecciona el micrófono de tu ordenador. Puedes hacer que el micrófono tenga la menor latencia posible yendo a Menu > System Settings/Options... y activando WDM Input Exclusive Mode (si escuchas crujidos al hablar, desactívalo) y cambiando Engine Mode a Swift;

source: Make sure the Hardware Input where you selected your microphone is sending sound through A1 by enabling the corresponding button next to the fader;
es_es: Asegúrate de que el Hardware Input donde has seleccionado tu micrófono envía sonido a través de A1 activando el botón correspondiente al lado del fader;

source: On Jamulus, under Settings, select JackRouter as your Soundcard Device;
es_es: En Jamulus, en Configuración, selecciona JackRouter como tu Dispositivo de Audio;

source: On Jack Control, if you click the Connect button, you should now see three devices: portaudio (your external audio interface), voicemeeter and jamulus. If Jamulus doesn't appear, try connecting and disconnecting from any server to enable it;
es_es: En Jack Control, si haces clic en el botón de Conectar, deberías ver ahora tres dispositivos: portaudio (tu interfaz de audio externo), voicemeeter y Jamulus. Si Jamulus no aparece, intenta conectar y desconectar de cualquier servidor para activarlo;

source: To test things out, on Jack Control, connect portaudio and voicemeeter output ports to jamulus input ports, then connect jamulus output ports to portaudio input ports (assuming you'll be using your external audio interface to listen, otherwise you can use voicemeeter to redirect the sound to another device, which I will not cover on this guide). Connect to a server on Jamulus and test it out by speaking into the microphone and playing your instrument. If everything went well you should hear yourself;
es_es: Para probar si funciona, en Jack Control conecta los puertos de salida de portaudio y voicemeeter a los de entrada de Jamulus; luego conecta los puertos de salida de Jamulus a los de entrada de portaudio (se presupone que utilizarás el interfaz de audio externo para escuchar, si no puedes usar voicemeeter para redireccionar el sonido a otro dispositivo, lo cual no está cubierto por esta guía). Conéctate a un servidor en Jamulus y pruébalo hablando al micrófono y tocando el instrumento. Si todo ha ido bien deberías oírte;

source: To make JACK connections permanent, on Jack Control, open the Patchbay, add all inputs and outputs available (Add... > Select each Client > Click Add Plug until there's none left) and make the connections you wish to make permanent. This usually goes like connecting both system and voicemeeter outputs into jamulus input, and jamulus output into system input. Once done, save the Patchbay definition and Activate it. Now every time you start jamulus and connect to a server, the connections on JACK should automatically be done.
es_es: Para hacer permanentes las conexiones de JACK, en Jack Control, abre el Patchbay, añade todas las entradas y salidas disponibles (Añadir... > Seleccionar cada Cliente > Haz clic en Añadir Plug hasta que no quede ninguno) y haz las conexiones que quieras hacer permanentes. Esto normalmente implica conectar tanto las salidas de system y voicemeeter a la entrada de jamulus, y la salida de jamulus a la entrada de system. Una vez hecho, guarda el esquema de Patchbay y Actívalo. Ahora cada vez que arranques Jamulus y te conectes a un servidor, las conexiones en JACK deberían realizarse automáticamente.

source: Bonus:
es_es: Extra:

source: The Microphone can be muted and it's volume adjusted on VoiceMeeter. Be sure to play with the VOICE graph too (equalization), I find that my voice sounds better if I move it halfway into Lo;
es_es: El micrófono puede ser muteado y su volumen ajustado en VoiceMeeter. Asegúrate de jugar con el gráfico de VOICE también (equalización); resulta que mi voz suena mejor si lo muevo a la mitad de Lo;

source: Home \> Tips & Tricks \> Multiple Audio Interfaces
es_es: Inicio \> Consejos y Trucos \> Múltiples Interfaces de Audio

source: If you're using VoiceMeeter Banana or Potato, you can apply Gate to your microphone (useful to cut undesirable noises when you're not speaking);
es_es: Si estás utilizando VoiceMeeter Banana o Potato, puedes aplicar el Gate a tu micrófono (útil para eliminar ruidos indeseados cuando no estás hablando);

source: If you set your default playback device under Windows to one of VoiceMeeter's virtual inputs, you can route audio from your computer into JackRouter (and consequently, into Jamulus) by enabling the A1 button on the relevant input under Virtual Inputs. This is useful if you wish to play some audio through Jamulus (backing tracks, youtube, recordings, etc...)
es_es: Si configuras tu dispositivo predeterminado de reproducción bajo Windows para ser una de las entradas de VoiceMeeter, puedes dirigir audio de tu ordenador hacia JackRouter (y por tanto hacia Jamulus) activando el botón A1 en la entrada relevante bajo Virtual Inputs. Esto es útil si quieres reproducir audio a través de Jamulus (backing tracks, youtube, grabaciones, etc...)

source: Aggregate devices lets you do this. Just make sure your Jamulus version is 3.5.3 or higher.
es_es: Los Dispositivos Agregados te permiten hacer esto. Solo asegúrate de que tu versión de Jamulus es 3.5.3 o posterior.

source: On Linux, it is possible to route additional devices to Jack by using alsa_in.
es_es: En Linux, es posible conectar dispositivos adicionales a JACK utilizando alsa_in.

source: Requirements:
es_es: Requisitos:

source: Steps:
es_es: Pasos:

source: It is possible to run Jamulus with multiple Audio Interfaces on all three operating systems. Useful when we need to output an instrument through external audio card for minimal latency and computer microphone for communication. Other use cases may apply.
es_es: Es posible ejecutar Jamulus con múltiples interfaces de audio en los tres sistemas operativos. Esto es útil cuando necesitamos sacar el audio de un instrumento a través de una tarjeta de audio externa para una latencia mínima, y usar el micrófono del ordenador para la comunicación.

source: Follow this tutorial to route the desired interface into Jack by using alsa_in.
es_es: Sigue este tutorial para conectar el interfaz deseado a JACK utilizando alsa_in.

source: Jamulus should automatically route the JACK configured interface, adjustments can be made through the Connect button.
es_es: Jamulus debería conectar el interfaz configurado a JACK automáticamente; se pueden realizar ajustes mediante el botón Conectar.

source: Connect the device configured on step 1 into jamulus input.
es_es: Conecta el dispositivo configurado en el paso 1 a la entrada de Jamulus.

source: Use Patchbay as described on Windows section to make connections permanent.
es_es: Utiliza Patchbay tal como se describe en la sección sobre Windows para hacer que las conexiones sean permanentes.

source: Under Windows, the best option to run multiple interfaces through Jamulus at the same time is by using a combination of JACK Audio Connection Kit with VoiceMeeter. It can be accomplished with just VoiceMeeter, but I've found that it introduces some undesirable latency and it wasn't supporting 64 frame buffer size correctly as it was producing some noises through my headphones.
es_es: En Windows, la mejor opción para utilizar varias interfaces con Jamulus a la vez es con una combinación de JACK Audio Connection Kit con VoiceMeeter. Se puede conseguir solo con VoiceMeeter, pero en mi caso introduce latencia indeseada y no da soporte al tamaño de buffer de 64 correctamente, produciendo ruido en mis auriculares.

source: JACK for Windows;
es_es: JACK para Windows;

source: Voicemeeter (any version will do).
es_es: Voicemeeter (cualquier versión sirve).

source: Install and configure JACK on Windows - Make sure you select your best audio interface in the configuration steps, also add -r 48000 -p <desired frame buffer size> to ensure JACK is outputting audio in the required sample rate for Jamulus (48.000Hz). If your frame buffer size is too low for your hardware, you'll need to change it to a higher value;
es_es: Instala y configura JACK en Windows - Asegúrate de elegir tu mejor interfaz de audio en la configuración y también añade -r 48000 -p <tamaño de buffer deseado> para asegurarse de que JACK produce audio en la tasa de muestreo adecuada para Jamulus (48,000Hz). Si el buffer es demasiado bajo para tu hardware, tendrás que cambiarlo a un valor más alto;

source: Here's an example of the port forwarding settings in a Linksys router:
es_es: Aquí va un ejemplo de la configuración de puertos para un router Linksys:

source: See also portforward.com.
es_es: Ver también portforward.com.

source: Once you have your router set up, you can get your external (WAN) IP address using Google. Give this address to your friends so they can connect to your server (but see also the note on dynamic DNS below).
es_es: Una vez configurado el router, puedes obtener tu dirección IP (WAN) externa utilizando Google. Dales esta dirección a tus amigos/as para que puedan conectarse a tu servidor (pero también lee la nota sobre DNS dinámica abajo).

source: Points to note
es_es: Puntos a tener en cuenta

source: You do not need to open a port range as shown in the example above as long as you want to start only one instance of the Jamulus server on the same machine.
es_es: No necesitas abrir un rango de puertos como muestra el ejemplo de arriba si solo vas a abrir una instancia del servidor Jamulus en tu ordenador.

source: If using a different port than the default port (22124) you have to enter the port number after the server name or IP address separated by a colon in the Jamulus client (e. g. jamulus.dyndns.org:22120).
es_es: Si utilizas un puerto distinto al que se usa por defecto (22124) tienes que escribir el número del puerto detrás del nombre del servidor o la dirección IP, separado por dos puntos, en el cliente de Jamulus (por ej.: jamulus.dyndns.org:22120).

source: See also this excellent guide to running a private server by Simon Tomlinson on Facebook.
es_es: Ver también esta excelente guía sobre la operación de un servidor privado de Simon Tomlinson en Facebook (inglés).

source: Dynamic DNS and why you will probably need it
es_es: DNS dinámica y por qué es probable que lo necesites

source: Most domestic Internet connections will change their IP address after a period (hours, days or weeks). To make it easier for people to connect to you, you may therefore also want set up a dynamic DNS address. You can do this on the machine that you are running the Jamulus server on, or preferably your router may support it.
es_es: La mayoría de las conexiones domésticas a internet cambian su dirección IP tras un periodo de tiempo (horas, días o semanas). Por tanto, para facilitar que las personas se puedan conectar a ti, probablemente quieras establecer una dirección DNS dinámica. Puedes hacer esto en el ordenador en el cual ejecutas el servidor Jamulus, o preferiblemente en tu router si es compatible.

source: Home \> Running a Server \> Running a Private Server
es_es: Inicio \> Ejecutar un Servidor \> Ejecutar un Servidor Privado

source: Note also that your home router may also change the IP address of the machine that you are running your server on. In which case you may need either to give that machine a static IP in the router's DHCP configuration, or simply port forward to all the addresses in your LAN.
es_es: Nótese también que tu router doméstico puede cambiar la dirección IP del ordenador en el que ejecutas tu servidor. En este caso, tienes que darle a ese ordenador una IP estática en la configuración DHCP del router, o simplemente abre los puertos a todas las direcciones en tu red local.

source: Footnote for geeks
es_es: Nota para frikis

source: One of the many features of Jamulus that make it orgasmically wonderful is the fact that you can set up a server in seconds. But why do public servers not need port forwarding to do this?
es_es: Una de las muchas características de Jamulus que lo hacen orgásmicamente maravilloso es que puedes montar un servidor en segundos. ¿Pero los servidores públicos por qué no necesitan la validación de puertos?
